app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "jam_name", "password_digest", "soundcloud_access_token", "soundcloud_expires_at", "soundcloud_refresh_token", "soundcloud_user_id", "soundcloud_username", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    if @user.save